Tutorial3/Scale3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-30 	-5 	-10)
    (1470 	-5 	-10)
    (1470 	2215	-10)
    (-30 	2215 	-10)
    (-30	-5 	1850)
    (1470 	-5 	1850)
    (1470 	2215 	1850)
    (-30 	2215 	1850)
   
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 74 62) simpleGrading (1 1 1)//
);

edges
(
);

patches
(
   
wall vessel
    (
	(0 4 7 3)
        (2 6 5 1)
	(3 7 6 2)
	(0 3 2 1)
	(4 5 6 7)//outlet
	(1 5 4 0)//inlet
	      	    )
patch outlet
    (
	//(4 5 6 7)
      	    )
patch inlet
	(
	//(1 5 4 0)
	)
);

);



mergePatchPairs
(
);

// ************************************************************************* //
